{
  "_class_name": "Transformer2DModel",
  "_diffusers_version": "0.10.0.dev0",
  "attention_head_dim": 64,
  "num_attention_heads": 16,
  "num_layers": 24,
  "patch_size": 2,
  "cross_attention_dim": 1024,
  "in_channels": 8,
  "norm_eps": 1e-05,
  "norm_num_groups": 4,
  "only_cross_attention": false,
  "out_channels": 8,
  "sample_size": [256, 16],
  "use_linear_projection": true,
  "upcast_attention": true,
  "norm_type":"ada_norm_single",
  "num_embeds_ada_norm": 1024
}
